Repository: heterl0/yogitech-mobile-application
Catalog: lib/l10n/app_*.arb
Languages: vi

# onboarding_title_1
source: Welcome to YogiTech
vi: Chào mừng bạn đến với YogiTech

# onboarding_text_1
source: Your AI Yoga Assistant
vi: Trợ lý Yoga AI của bạn

# onboarding_title_2
source: Perfect Poses, Safer Practice
vi: Tư thế chuẩn, tập luyện an toàn hơn

# onboarding_text_2
source: AI helps you adjust your posture and avoid injuries
vi: AI giúp bạn điều chỉnh tư thế, tránh chấn thương

# onboarding_title_3
source: Rich Yoga Library
vi: Thư viện yoga phong phú

# onboarding_text_3
source: Suitable for all needs and levels
vi: Phù hợp với mọi nhu cầu và cấp độ

# onboarding_title_4
source: Track Progress, Conquer Goals
vi: Theo dõi tiến trình, chinh phục mục tiêu

# onboarding_text_4
source: Record your practice history and achievements
vi: Ghi lại lịch sử tập luyện và thành tích của bạn

# onboarding_title_5
source: Ready to Begin?
vi: Sẵn sàng bắt đầu?

# onboarding_text_5
source: Start your Yoga journey now!
vi: Bắt đầu hành trình Yoga của bạn ngay!

# thirtyDayYogaChallenge
source: 30 Day Yoga Challenge
vi: 30 Ngày Thử Thách Yoga

source: Improve Health and Flexibility!
vi: Tăng cường sức khỏe và sự dẻo dai!

source: Join Now!
vi: Tham gia ngay!

source: Yoga Changed My Life
vi: Yoga đã thay đổi cuộc sống của tôi

# minhAnhInspirationalStory
source: Minh Anh's Inspirational Story
vi: Câu chuyện truyền cảm hứng của Minh Anh

source: Share Your Journey!
vi: Chia sẻ hành trình của bạn!

source: Special Offer for New Members!
vi: Ưu đãi đặc biệt dành cho thành viên mới!

# receiveTwoFreeSessions
source: Receive 2 Free Personal Sessions
vi: Nhận ngay 2 buổi tập cá nhân miễn phí

# subscribePremiumNow
source: Subscribe to Premium Now!
vi: Đăng ký gói Premium ngay!

source: Yoga Tips for Beginners
vi: Mẹo Yoga cho người mới bắt đầu

# fiveBasicPoses
source: 5 Basic Poses to Get Started with Yoga
vi: 5 tư thế cơ bản giúp bạn làm quen với Yoga

source: Explore Now!
vi: Khám phá ngay!

# exercise
source: Exercises
vi: Các bài tập

source: Login
vi: Đăng nhập

# loginWithGoogle
source: Sign In with Google
vi: Đăng nhập với Google

source: Return Login
vi: Trở lại đăng nhập

# verifyEmail
source: Verify your Email address
vi: Xác nhận Email của bạn

# checkYourEmail
source: Check your email to get a link to active the new account, please
vi: Vui lòng kiểm tra email của bạn để nhận liên kết kích hoạt tài khoản mới.

source: Password
vi: Mật khẩu

source: Forgot password?
vi: Quên mật khẩu?

source: or sign in with
vi: hoặc đăng nhập bằng

# dontHaveAccount
source: You don’t have an account?
vi: Bạn chưa có tài khoản?

source: Sign up
vi: Đăng ký

source: Username
vi: Tên người dùng

source: Confirm password
vi: Xác nhận mật khẩu

# haveAccount
source: You have an account?
vi: Bạn đã có tài khoản?

source: Sign in
vi: Đăng nhập

# forgotPasswordTitle
source: Forgot Password
vi: Quên mật khẩu

source: Send OTP
vi: Gửi OTP

# sendedOTP
source: Sended OTP for
vi: Đã gửi OTP cho

source: OTP confirm
vi: Xác nhận OTP

# resendOTP
source: Resend a new OTP
vi: Gửi lại OTP mới

source: Confirm
vi: Xác nhận

source: Reset password
vi: Đặt lại mật khẩu

source: New password
vi: Mật khẩu mới

source: Confirm new password
vi: Xác nhận mật khẩu mới

source: Reset
vi: Đặt lại

source: Welcome to Yogi
vi: Chào mừng đến Yogi

# fillInformation
source: Please fill in information here to optimize your experience
vi: Vui lòng điền thông tin ở đây để tối ưu hóa trải nghiệm của bạn

source: First name
vi: Tên

source: Last name
vi: Họ

source: Birthday
vi: Ngày sinh

source: Height (cm)
vi: Chiều cao (cm)

source: Weight (kg)
vi: Cân nặng (kg)

source: Next
vi: Tiếp theo

# interested
source: Interested in
vi: Yêu thích

source: Choose
vi: Chọn

source: fitness
vi: Thể dục

source: nature
vi: Thiên nhiên

source: health
vi: Sức khỏe

source: happy
vi: Hạnh phúc

source: sports
vi: Thể thao

source: breath
vi: Hơi thở

source: mood
vi: Tâm trạng

source: motivation
vi: Động lực

source: Let’s go
vi: Đi thôi

source: Streak
vi: Chuỗi ngày

source: Search
vi: Tìm kiếm

source: Try this exercise
vi: Thử bài tập này

source: for beginner
vi: cho người mới bắt đầu

source: For you
vi: Dành cho bạn

source: Newest
vi: Mới nhất

source: Home
vi: Trang chủ

source: Activities
vi: Hoạt động

source: Meditate
vi: Thiền

source: Profile
vi: Hồ sơ

source: minutes
vi: phút

source: seconds
vi: giây

source: Filter
vi: Lọc

# category
source: Muscle group
vi: Danh mục

# choosecCategory
source: Choose muscle group
vi: Chọn danh mục

source: Apply
vi: Áp dụng

source: day streak!
vi: Chuỗi ngày!

source: in this month
vi: trong tháng này

source: practiced in month
vi: đã tập luyện trong tháng

source: begin of the streak
vi: bắt đầu của chuỗi

source: Exercise detail
vi: Chi tiết bài tập

source: Poses
vi: Các tư thế

source: Pose
vi: Tư thế

source: Comment
vi: Bình luận

source: Your comment
vi: Bình luận của bạn

source: Do exercise
vi: Thực hiện bài tập

source: For best result
vi: Để đạt kết quả tốt nhất

# keepFaceVisible
source: Keep your face fully visible in the camera frame
vi: Giữ mặt bạn trong khung hình của camera

source: Good job!
vi: Làm tốt lắm!

source: Accuracy:
vi: Độ chính xác:

source: Calories burned:
vi: Calo đã đốt cháy:

source: Burned
vi: Đốt cháy

# burnInThisWeek
source: Calories burned in this week
vi: Lượng calo bạn đã đốt cháy trong một tuần qua

source: Finish
vi: Kết thúc

# currentPlan
source: Your current plan
vi: Gói hiện tại của bạn

# waitToEndPlan
source: You have to wait to end this plan to subscribe to another plan
vi: Bạn phải đợi gói này kết thúc để đăng ký gói khác

source: Once a month
vi: Một lần một tháng

source: Unsubscription
vi: Hủy đăng ký

# choosePlan
source: Choose a plan
vi: Chọn gói

# unlockPremium
source: Unlock all premium exercises
vi: Mở khóa tất cả các bài tập cao cấp

# needPremium
source: This function need a premium account
vi: Tính năng này cần tài khoản cao cấp

source: Once a week
vi: Một lần một tuần

source: Once a year
vi: Một lần một năm

source: Subscription
vi: Đăng ký

# wantToUnsubscribe
source: Do you want to unsubcription
vi: Bạn có muốn hủy đăng ký

# unsubDetail
source: Canceling your subscription will immediately terminate your plan. No refunds will be issued.
vi: Hành động này sẽ khiến gói đăng ký của bạn bị hủy ngay lập tức và không được hoàn trả.

source: Cancel
vi: Hủy bỏ

source: Subscription by
vi: Đăng ký bằng

source: gems
vi: đá quý

source: Payment history
vi: Lịch sử thanh toán

# upgradeYourSub
source: Unlock your full potential! Upgrade to premium for exclusive features and maximize your experience.
vi: Nâng cấp lên bản cao cấp để có các tính năng độc quyền và tối đa hóa trải nghiệm của bạn.

# userSubIsNull
source: Subscription failed: User subscription is null
vi: Đăng ký thất bại: Gói đăng ký của người dùng không tồn tại.

# notAllowMenthod
source: This subscription does not allow Gem payment method.
vi: Gói đăng ký này không cho phép thanh toán bằng Gem.

# notEnoughGem
source: Not enough Gem for subscription.
vi: Không đủ Gem để đăng ký.

source: Subscription failed
vi: Đăng ký thất bại

source: or
vi: hoặc

source: day
vi: ngày

source: month
vi: tháng

source: year
vi: năm

source: Rank
vi: Xếp hạng

source: Event
vi: Sự kiện

source: days left
vi: ngày còn lại

source: Participants
vi: Tham gia

source: Leaderboard
vi: Bảng xếp hạng

# listOfExercises
source: Exercises
vi: Các bài tập

source: Join in
vi: Tham gia

source: Meditation streak
vi: Chuỗi ngày thiền

source: Sounds
vi: Âm thanh

source: Start
vi: Bắt đầu

source: Pause
vi: Tạm dừng

# notiMeditationTitle
source: Meditation
vi: Thiền

# notiMeditationBody
source: Meditation finish
vi: Kết thúc thiền

# listFriend
source: List of Friend
vi: Danh sách bạn bè

source: Calorie
vi: Calo

# totalCalories
source: Your total of calories
vi: Tổng số calo của bạn

# social
source: Notification
vi: Thông báo

# yourFriends
source: Your friends and more
vi: Kết nối với bạn bè

source: Personalized Exercise
vi: Bài tập cá nhân hóa

# customizeExercise
source: Your customize exercise
vi: Bài tập tùy chỉnh của bạn

source: Following
vi: Bạn theo dõi

source: Follower
vi: Theo dõi bạn

source: Unfollow
vi: Bỏ theo dõi

source: Follow
vi: Theo dõi

source: Logout
vi: Đăng xuất

source: Setting
vi: Cài đặt

source: Dark mode
vi: Chế độ tối

source: Vietnamese UI?
vi: Giao diện tiếng Việt?

source: Reminder
vi: Nhắc nhở

# exerciseReminder
source: Reminds you of exercise time
vi: Nhắc nhở bạn về thời gian tập luyện

# noReminder
source: There are no reminder
vi: Chưa có thông báo nhắc nhở

# yourInfo
source: Your information, avatar, and BMI
vi: Thông tin của bạn, avatar, và BMI

# notifications
source: App Notifications
vi: Về việc thông báo

# appNotifications
source: Application notifications
vi: Thông báo ứng dụng

source: Everyday
vi: Hàng ngày

# noDays
source: No days selected.
vi: Không có ngày được chọn.

# setReminder
source: Set up Reminder
vi: Thiết lập nhắc nhở

source: Save
vi: Lưu

source: Loop
vi: Lặp lại

source: Loop in week
vi: Lặp lại trong tuần

source: Delete reminder
vi: Xóa nhắc nhở

# yourReminder
source: Your Remminder
vi: Nhắc nhở tùy chỉnh

# yourReminderDetail
source: It is yoga time. Do you remember?
vi: Đã tới lúc luyện tập rồi, bạn nhớ chứ?

source: Streak saver
vi: Bảo vệ chuỗi

source: New activities
vi: Hoạt động mới

source: New event
vi: Sự kiện mới

source: Edit profile
vi: Điều chỉnh hồ sơ

source: Change avatar
vi: Đổi ảnh đại diện

source: Avatar
vi: Ảnh đại diện

source: Phone number
vi: Số điện thoại

source: Date of birth
vi: Ngày sinh

source: Gender
vi: Giới tính

# sellectGender
source: Choose gender
vi: Chọn giới tính

source: Male
vi: Nam

source: Female
vi: Nữ

source: Other
vi: Khác

source: Change
vi: Thay đổi

source: Change password
vi: Đổi mật khẩu

source: Old password
vi: Mật khẩu cũ

source: Change BMI
vi: Thay đổi BMI

# underweight
source: You are mild thinness.
vi: Bạn thiếu cân

# normalWeight
source: You are normal
vi: Bạn bình thường

# overweight
source: You are overweight
vi: Bạn thừa cân

# obesity
source: You are obesity
vi: Bạn béo phì

# recalculate
source: Recaculate
vi: Tính lại

# achievement
source: Archivement
vi: Thành tích

source: Friends
vi: Bạn bè

# caloriesBurnedInMonth
source: calories burned
vi: calo đã đốt cháy

# burnedInMonth
source: burned in this month
vi: đã đốt cháy trong tháng này

source: Your Exercise
vi: Bài tập của bạn

source: Premium Feature
vi: Tính năng trả phí

source: Advance
vi: Nâng cao

source: Professional
vi: Chuyên nghiệp

source: Friend Profile
vi: Hồ sơ bạn bè

# error
source: An error occurred while processing your request. Please try again later.
vi: Có lỗi xảy ra trong quá trình xử lý. Vui lòng thử lại sau.

# loginMissing
source: Please fill in all the login information.
vi: Vui lòng điền thông tin đăng nhập.

# loginInvalid
source: Invalid email or password.
vi: Tài khoản và mật khẩu không hợp lệ.

# soundRain
source: Sound of rain
vi: Tiếng mưa rơi

# soundRainDescription
source: Deep sound on rainy days.
vi: Âm thanh nhẹ nhàng những ngày mưa.

# soundWave
source: Ocean Waves
vi: Tiếng sóng biển

# soundWaveDescription
source: Immerse yourself in the waves.
vi: Thả mình vào những cơn sóng.

# soundMorning
source: Morning
vi: Buổi sớm mai

# soundMorningDescription
source: Enjoy the echoes of a new day.
vi: Tận hưởng những âm vang ngày mới.

# soundNature
source: Nature
vi: Thiên nhiên

# soundNatureDescription
source: Harmonize with pristine nature.
vi: Hòa nhịp với thiên nhiên trong lành.

# endTimer
source: The countdown timer has ended!
vi: Kết thúc đếm ngược!

# locale
source: en
vi: vi

# dayInWeek
source: Weekdays
vi: Ngày trong tuần

# dayWeeken
source: Weekend
vi: Cuối tuần

# reTime
source: Reminder time
vi: Thời gian nhắc nhở

source: Duration
vi: Thời lượng

source: Days
vi: Ngày

# numOfExercise
source: Number of exercise:
vi: Số lượng bài tập:

# numOfCandidate
source: Number of candidate:
vi: Người tham gia:

source: Point
vi: Điểm

source: Give up
vi: Hủy đăng ký

# eventNotStart
source: The event is not start.
vi: Sự kiện chưa diễn ra.

# eventPassed
source: The date has passed.
vi: Sự kiện đã kết thúc

# eventRemain
source: left.
vi: còn lại.

source: hours
vi: giờ

source: Muscles
vi: Nhóm cơ

source: End
vi: Kết thúc

source: Value
vi: Giá trị

# passwordChangedSuccessfully
source: Change password successful
vi: Đổi mật khẩu thành công

# passwordsDoNotMatch
source: New password and confirm password not match
vi: Mật khẩu mới và xác nhận mật khẩu không khớp

# passwordChangeFailed
source: Change password failed!
vi: đổi mật khẩu thất bại

source: See all
vi: Xem tất cả

# updateSuccess
source: Update successfully!
vi: Cập nhật thông tin thành công!

# updateFail
source: Update Failed.
vi: Cập nhật thông tin thất bại. Vui lòng thử lại sau.

source: Name
vi: Tên

# yourFistName
source: Enter your first name
vi: Nhập vào tên của bạn

# yourLastName
source: Enter your last name
vi: Nhập vào họ của bạn

# sendResetPasswordTo
source: Forget password request email has been sent to
vi: Yêu cầu quên mật khẩu đã được gửi đến email của bạn

# supMuscle
source: Supporting Muscles:
vi: Hỗ trợ các nhóm cơ:

# selectLevel
source: Sellect Level
vi: Chọn cấp độ

source: Level
vi: Độ khó

source: Beginner
vi: Mới bắt đầu

source: Intermediate
vi: Trung cấp

source: Advanced
vi: Nâng cao

source: Close
vi: Đóng

# request
source: Send request
vi: Gửi yêu cầu

# invalidEmail
source: Your email is Invalid!
vi: Email không hợp lệ

# dontEmpty
source: Please fill in both Email and Password fields!
vi: Email và mật khẩu không được bỏ trống!

# mustInput
source: cannot be empty.
vi: không được bỏ trống.

source: invalid.
vi: không hợp lệ.

# doesntexist
source: Email or Password is not correct!
vi: Tài khoản hoặc mật khẩu không đúng!

# enterEmail
source: Please enter your email!
vi: Vui lòng nhập email!

source: No result
vi: Không có kết quả

# inputName
source: Enter username
vi: Nhập tên người dùng

# baned
source: your account has been blocked.
vi: Tài khoản của bạn đã bị chặn.

source: Create
vi: Tạo

source: Delete
vi: Xóa

source: Delete exercise
vi: Xóa bài tập

# areYouSureDeleteExercise
source: Are you sure you want to delete this exercise?
vi: Bạn có chắc muốn xóa bài tập này?

source: Delete successfully
vi: Xóa thành công

source: Delete failed
vi: Xóa thất bại

source: Create exercise
vi: Tạo bài tập

source: Update exercise
vi: Sửa bài tập

# errorLoadingExercises
source: Loading exercises fail
vi: Lỗi tải bài tập

source: No exercises found
vi: Chưa có bài tập

source: Title
vi: Tiêu đề

source: Benefits
vi: Các lợi ích

source: Select poses
vi: Chọn các tư thế

# needToJoin
source: You need to join the event to see exercises in this event.
vi: Bạn cần phải tham gia sự kiện trước khi có thể xem các bài tập trong sự kiện này.

# usingEmail
source: Please continue your login using email
vi: Tiếp tục đăng nhập bằng Email

# anError
source: An error occurred. Please try again later.
vi: Có lỗi xảy ra, xin vui lòng thử lại sau.

# failSignIn
source: Failed to sign in:
vi: Lỗi đăng nhập:

# missingInfor
source: Missing information
vi: Thiếu thông tin

# createSuccess
source: Create successful
vi: Tạo thành công

# createFail
source: Create failed
vi: Tạo thất bại

# passDonotMatch
source: Passwords do not match
vi: Mật khẩu không khớp

# failRegister
source: Failed to register
vi: Đăng ký thất bại

# developmentFeature
source: Feature in Development
vi: Tính năng đang được phát triển

# featureInDevelopment
source: This feature is currently in development.
vi: Tính năng này sẽ được triển khai trong tương lai.

# noHistory
source: There are no history
vi: Chưa có lịch sử

# noPose
source: There are no pose
vi: Chưa có tư thế
